layer {
  name: "data"
  type: "Input"
  top: "template"
  top: "search"
  input_param { shape: { dim: 1 dim: 3 dim: 127 dim: 127 } 
                shape: { dim: 1 dim: 3 dim: 287 dim: 287 }}
}
layer {
  name: "backbone.features.0_temp"
  type: "Convolution"
  bottom: "template"
  top: "backbone.features.0_temp"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 96
    kernel_size: 11
    stride: 2
  }
  blobs {
    data: 0.000282
    data: -0.000741
    data: -0.002023
    data: 0.001384
    data: -0.000778
    data: -0.001072
    data: 0.000567
    data: 0.000427
    data: -0.002724
    data: -0.000760
    data: 0.000175
    data: -0.000141
    data: -0.000071
    data: 0.000593
    data: -0.001418
    data: 0.000479
    data: 0.000507
    data: -0.002020
    data: 0.003807
    data: -0.002881
    data: 0.002831
    data: 0.000177
    data: -0.001146
    data: 0.000338
    data: 0.001472
    data: -0.001883
    data: 0.000434
    data: -0.000518
    data: -0.000055
    data: 0.000895
    data: -0.000901
    data: 0.002316
    data: -0.001742
    data: -0.000750
    data: 0.001915
    data: -0.000645
    data: -0.000482
    data: 0.001482
    data: -0.000657
    data: 0.001706
    data: -0.000658
    data: -0.000056
    data: 0.000811
    data: -0.000078
    data: -0.001413
    data: 0.000883
    data: -0.000929
    data: 0.002068
    data: -0.001556
    data: 0.000568
    data: 0.001013
    data: -0.001952
    data: 0.002328
    data: -0.001070
    data: 0.001084
    data: 0.000077
    data: 0.000008
    data: 0.000966
    data: 0.000795
    data: -0.000230
    data: 0.001208
    data: 0.000508
    data: -0.000797
    data: 0.002956
    data: -0.000851
    data: 0.001800
    data: 0.001491
    data: -0.001665
    data: 0.000315
    data: -0.000648
    data: 0.001834
    data: -0.000273
    data: 0.000588
    data: -0.000034
    data: 0.002671
    data: -0.002454
    data: 0.000910
    data: 0.001388
    data: -0.000852
    data: -0.000549
    data: 0.000923
    data: 0.001453
    data: -0.000317
    data: 0.000288
    data: 0.001167
    data: 0.001049
    data: -0.002202
    data: 0.001544
    data: -0.001087
    data: 0.001202
    data: 0.000820
    data: 0.001123
    data: 0.000341
    data: -0.000898
    data: 0.001035
    data: 0.000758
    data: -0.001159
    data: -0.000095
    data: 0.000607
    data: -0.000929
    data: 0.000513
    data: -0.000092
    data: 0.000131
    data: 0.000190
    data: 0.000528
    data: -0.000232
    data: 0.000907
    data: -0.000844
    data: 0.002421
    data: -0.001257
    data: -0.000468
    data: -0.000329
    data: 0.000709
    data: 0.000204
    data: -0.000296
    data: 0.001922
    data: -0.000999
    data: -0.000041
    data: 0.000054
    data: 0.000891
    data: -0.001222
    data: 0.000708
    data: -0.001006
    data: -0.001895
    data: 0.001878
    data: -0.001031
    data: -0.001020
    data: 0.000616
    data: 0.000102
    data: -0.003183
    data: -0.000637
    data: 0.000314
    data: -0.000651
    data: -0.000616
    data: 0.000626
    data: -0.001426
    data: 0.000348
    data: 0.000446
    data: -0.002647
    data: 0.003379
    data: -0.004311
    data: 0.002106
    data: -0.000336
    data: -0.001592
    data: -0.000683
    data: 0.001632
    data: -0.002222
    data: 0.000510
    data: -0.000756
    data: -0.001554
    data: 0.001036
    data: -0.002050
    data: 0.002017
    data: -0.002664
    data: -0.001183
    data: 0.000956
    data: -0.001101
    data: -0.000627
    data: 0.000850
    data: -0.002101
    data: 0.000717
    data: -0.001813
    data: -0.001083
    data: 0.000304
    data: -0.002647
    data: -0.002432
    data: 0.000304
    data: -0.001976
    data: 0.000721
    data: -0.002693
    data: -0.000057
    data: 0.000052
    data: -0.003626
    data: 0.001012
    data: -0.002052
    data: -0.000399
    data: -0.001472
    data: -0.001290
    data: 0.000375
    data: -0.000936
    data: -0.002265
    data: -0.000362
    data: -0.001092
    data: -0.003215
    data: 0.002267
    data: -0.002330
    data: 0.000232
    data: 0.000032
    data: -0.002840
    data: -0.000067
    data: -0.002348
    data: -0.000018
    data: -0.002209
    data: -0.001427
    data: -0.001312
    data: 0.002399
    data: -0.004601
    data: -0.000596
    data: 0.000093
    data: -0.002247
    data: -0.001570
    data: -0.000576
    data: -0.000433
    data: -0.001691
    data: -0.001466
    data: 0.000118
    data: -0.000159
    data: -0.004225
    data: 0.000588
    data: -0.002464
    data: -0.000810
    data: -0.000869
    data: -0.000372
    data: -0.001305
    data: -0.002137
    data: -0.000593
    data: -0.000071
    data: -0.003526
    data: -0.001738
    data: -0.000348
    data: -0.001746
    data: -0.000855
    data: -0.001825
    data: -0.001566
    data: -0.001998
    data: -0.000639
    data: -0.001351
    data: -0.000294
    data: -0.002353
    data: 0.001486
    data: -0.002546
    data: -0.001806
    data: -0.002561
    data: -0.000150
    data: -0.001222
    data: -0.002035
    data: 0.000811
    data: -0.001936
    data: -0.001246
    data: -0.001444
    data: -0.000021
    data: -0.002448
    data: 0.000675
    data: -0.000391
    data: -0.001342
    data: 0.001708
    data: -0.000891
    data: -0.001304
    data: -0.000000
    data: 0.000115
    data: -0.002965
    data: -0.000239
    data: 0.000586
    data: 0.000458
    data: -0.000856
    data: -0.000041
    data: -0.000782
    data: 0.000756
    data: 0.000817
    data: -0.002841
    data: 0.002438
    data: -0.003511
    data: 0.002616
    data: 0.000061
    data: -0.000975
    data: 0.000260
    data: 0.000777
    data: -0.001798
    data: 0.000795
    data: -0.000346
    data: -0.000719
    data: 0.000345
    data: -0.001774
    data: 0.002245
    data: -0.002248
    data: -0.000787
    data: 0.001422
    data: -0.000754
    data: -0.000351
    data: 0.000771
    data: -0.001511
    data: 0.000356
    data: -0.001326
    data: -0.000682
    data: 0.001033
    data: -0.001723
    data: -0.000760
    data: 0.001073
    data: -0.001189
    data: 0.000853
    data: -0.002397
    data: -0.000008
    data: 0.000943
    data: -0.003102
    data: 0.000794
    data: -0.001176
    data: -0.000114
    data: 0.000011
    data: -0.000183
    data: 0.000844
    data: 0.000365
    data: -0.001434
    data: 0.000483
    data: -0.000335
    data: -0.002593
    data: 0.003121
    data: -0.002001
    data: 0.000250
    data: 0.001272
    data: -0.000535
    data: 0.000930
    data: -0.001405
    data: 0.000176
    data: -0.001040
    data: -0.000375
    data: -0.000959
    data: 0.003802
    data: -0.002835
    data: 0.001297
    data: 0.001927
    data: -0.000030
    data: -0.000346
    data: 0.000484
    data: 0.000250
    data: -0.000237
    data: -0.000094
    data: 0.001245
    data: 0.001408
    data: -0.002577
    data: 0.002126
    data: -0.000153
    data: 0.001213
    data: 0.000502
    data: 0.000530
    data: 0.000151
    data: -0.001150
    data: 0.000800
    data: 0.001020
    data: -0.001374
    data: 0.000872
    data: 0.000588
    data: 0.000723
    data: 0.001459
    data: 0.000543
    data: -0.000331
    data: -0.000821
    data: 0.001069
    data: 0.000271
    data: 0.001067
    data: -0.000124
    data: 0.003424
    data: 0.000114
    data: 0.001495
    data: 0.000252
    data: 0.002516
    data: 0.000882
    data: -0.000067
    data: 0.002427
    data: 0.000318
    data: 0.001419
    data: 0.000984
    data: 0.002491
    data: 0.000597
    data: 0.002268
    data: -0.003559
    data: -0.004990
    data: -0.004695
    data: -0.006469
    data: -0.002273
    data: -0.007544
    data: -0.009805
    data: -0.000821
    data: -0.008938
    data: -0.007463
    data: -0.003346
    data: 0.004752
    data: 0.002421
    data: -0.003205
    data: -0.004605
    data: -0.019508
    data: -0.001788
    data: 0.006591
    data: -0.012127
    data: -0.009451
    data: -0.007429
    data: 0.010376
    data: -0.002974
    data: -0.009767
    data: -0.006935
    data: 0.004737
    data: 0.011672
    data: -0.011302
    data: -0.016369
    data: -0.003301
    data: 0.001353
    data: -0.009268
    data: -0.005524
    data: 0.006330
    data: 0.020185
    data: 0.000793
    data: -0.022986
    data: -0.023883
    data: 0.015647
    data: 0.010196
    data: -0.012279
    data: -0.016975
    data: -0.001136
    data: 0.014166
    data: 0.000538
    data: -0.016531
    data: 0.003544
    data: 0.033162
    data: 0.009320
    data: -0.029928
    data: -0.014588
    data: 0.000995
    data: 0.001988
    data: -0.005974
    data: 0.004544
    data: 0.012231
    data: 0.011871
    data: -0.006684
    data: -0.016651
    data: 0.002209
    data: 0.005356
    data: 0.003289
    data: -0.004325
    data: -0.008874
    data: -0.007530
    data: -0.001222
    data: 0.003598
    data: 0.010881
    data: 0.010555
    data: 0.005739
    data: -0.003706
    data: 0.010520
    data: -0.005149
    data: -0.009839
    data: 0.000026
    data: 0.004310
    data: 0.014636
    data: 0.005660
    data: -0.003579
    data: -0.000452
    data: 0.012012
    data: 0.005398
    data: -0.011653
    data: 0.004358
    data: 0.005429
    data: -0.002088
    data: -0.007574
    data: 0.001462
    data: 0.007771
    data: 0.017066
    data: 0.007751
    data: -0.005004
    data: 0.001700
    data: 0.017760
    data: 0.007420
    data: -0.007861
    data: -0.004081
    data: 0.002110
    data: 0.004374
    data: 0.006045
    data: 0.002127
    data: 0.006675
    data: 0.011017
    data: 0.004955
    data: -0.005896
    data: -0.000852
    data: 0.005618
    data: 0.003853
    data: -0.002019
    data: 0.007968
    data: 0.006724
    data: 0.005138
    data: 0.006855
    data: 0.001379
    data: 0.007437
    data: 0.008725
    data: 0.003426
    data: -0.001636
    data: -0.000637
    data: 0.001264
    data: 0.006242
    data: 0.003918
    data: 0.005715
    data: 0.010251
    data: 0.009647
    data: 0.015500
    data: 0.010930
    data: 0.007741
    data: 0.015889
    data: 0.007383
    data: 0.007322
    data: -0.003367
    data: 0.009233
    data: 0.010368
    data: 0.010290
    data: 0.013035
    data: -0.000981
    data: 0.016788
    data: 0.025679
    data: 0.007786
    data: 0.009033
    data: 0.007655
    data: 0.005302
    data: -0.001713
    data: -0.005493
    data: 0.002318
    data: 0.021342
    data: 0.031021
    data: 0.005704
    data: 0.001507
    data: 0.016857
    data: 0.021138
    data: 0.008345
    data: -0.015358
    data: 0.000864
    data: 0.022684
    data: 0.008349
    data: -0.017070
    data: -0.015778
    data: 0.031880
    data: 0.031968
    data: 0.006634
    data: 0.001267
    data: 0.015068
    data: 0.001809
    data: -0.012540
    data: -0.030817
    data: -0.002345
    data: 0.041090
    data: 0.017421
    data: -0.023288
    data: -0.001232
    data: 0.017971
    data: 0.019465
    data: 0.008151
    data: -0.010276
    data: 0.001370
    data: -0.001382
    data: -0.021196
    data: -0.029180
    data: 0.002691
    data: 0.012837
    data: 0.014409
    data: 0.009086
    data: 0.003196
    data: 0.004167
    data: -0.019543
    data: -0.012877
    data: -0.003109
    data: 0.000043
    data: -0.006173
    data: -0.014447
    data: 0.009127
    data: -0.003736
    data: -0.002019
    data: 0.009304
    data: 0.014580
    data: 0.000034
    data: -0.011189
    data: -0.026140
    data: -0.019853
    data: -0.000712
    data: -0.005971
    data: -0.023003
    data: 0.001336
    data: 0.008773
    data: 0.001981
    data: -0.001681
    data: -0.015618
    data: -0.007613
    data: -0.001832
    data: -0.012723
    data: -0.028065
    data: -0.013806
    data: 0.003797
    data: -0.001302
    data: -0.012011
    data: -0.003960
    data: 0.005553
    data: -0.013026
    data: -0.011864
    data: -0.015656
    data: -0.010347
    data: -0.005667
    data: -0.011416
    data: -0.022106
    data: -0.015056
    data: 0.002095
    data: 0.002013
    data: -0.003221
    data: -0.008421
    data: -0.011793
    data: -0.012176
    data: -0.011783
    data: -0.015672
    data: -0.007090
    data: -0.003997
    data: -0.006618
    data: -0.011453
    data: -0.004564
    data: -0.001478
    data: -0.002597
    data: -0.009941
    data: -0.008916
    data: -0.008309
    data: -0.010558
    data: -0.004339
    data: -0.008341
    data: -0.010755
    data: 0.001556
    data: -0.004811
    data: -0.001607
    data: -0.007582
    data: 0.002121
    data: 0.001097
    data: -0.003877
    data: -0.006259
    data: -0.022875
    data: -0.003638
    data: 0.004839
    data: -0.008537
    data: -0.006930
    data: -0.004173
    data: 0.008243
    data: -0.005229
    data: -0.010234
    data: -0.008884
    data: 0.003123
    data: 0.008767
    data: -0.016372
    data: -0.020677
    data: -0.001956
    data: 0.004734
    data: -0.005701
    data: -0.007106
    data: 0.005259
    data: 0.022094
    data: 0.003438
    data: -0.027793
    data: -0.033332
    data: 0.011944
    data: 0.011556
    data: -0.011174
    data: -0.017122
    data: -0.000940
    data: 0.013228
    data: -0.001843
    data: -0.023918
    data: -0.001359
    data: 0.039269
    data: 0.008226
    data: -0.036307
    data: -0.014807
    data: 0.001732
    data: 0.004791
    data: -0.008169
    data: 0.002220
    data: 0.013857
    data: 0.010721
    data: -0.011493
    data: -0.023013
    data: 0.004027
    data: 0.008462
    data: 0.003456
    data: -0.006272
    data: -0.011671
    data: -0.010702
    data: -0.004794
    data: 0.001949
    data: 0.015968
    data: 0.018563
    data: 0.009247
    data: -0.003456
    data: 0.013239
    data: -0.004737
    data: -0.009251
    data: -0.000557
    data: 0.001845
    data: 0.012075
    data: 0.003601
    data: -0.007661
    data: 0.003203
    data: 0.020437
    data: 0.008826
    data: -0.013617
    data: 0.009043
    data: 0.010479
    data: -0.001106
    data: -0.008399
    data: -0.000885
    data: 0.007409
    data: 0.015826
    data: 0.006086
    data: -0.005927
    data: 0.004434
    data: 0.017732
    data: 0.007692
    data: -0.005042
    data: -0.002758
    data: 0.002452
    data: 0.002128
    data: 0.002889
    data: 0.001218
    data: 0.007424
    data: 0.013994
    data: 0.006632
    data: -0.007288
    data: -0.003979
    data: 0.010982
    data: 0.007301
    data: -0.002222
    data: 0.006066
    data: 0.002804
    data: 0.003785
    data: 0.004332
    data: 0.003216
    data: 0.010901
    data: 0.012536
    data: 0.006956
    data: -0.000558
    data: 0.001796
    data: 0.000799
    data: -0.005410
    data: -0.004096
    data: -0.016462
    data: -0.012788
    data: 0.012726
    data: 0.014367
    data: 0.014225
    data: -0.020480
    data: 0.004158
    data: -0.010986
    data: -0.015979
    data: 0.012922
    data: -0.012943
    data: 0.010665
    data: 0.001134
    data: 0.007547
    data: 0.023256
    data: -0.009231
    data: -0.009805
    data: -0.001982
    data: -0.003708
    data: -0.006226
    data: -0.012655
    data: 0.003712
    data: 0.010775
    data: 0.016505
    data: 0.016374
    data: 0.022340
    data: -0.004240
    data: -0.004755
    data: -0.018003
    data: -0.012412
    data: -0.016545
    data: -0.009608
    data: 0.014287
    data: 0.022159
    data: 0.019962
    data: 0.046811
    data: 0.031135
    data: 0.003767
    data: 0.003064
    data: -0.009347
    data: -0.019159
    data: -0.010258
    data: -0.014634
    data: 0.012097
    data: 0.017593
    data: 0.070140
    data: 0.079520
    data: 0.052160
    data: 0.010940
    data: -0.008144
    data: -0.010061
    data: -0.019085
    data: -0.020720
    data: -0.006056
    data: 0.014738
    data: 0.039740
    data: 0.063025
    data: 0.096526
    data: 0.084126
    data: 0.041543
    data: 0.020687
    data: -0.010408
    data: -0.014612
    data: -0.008733
    data: 0.009607
    data: 0.022545
    data: 0.050366
    data: 0.037383
    data: 0.004650
    data: 0.028117
    data: 0.057209
    data: 0.031555
    data: 0.010977
    data: 0.001354
    data: -0.018254
    data: 0.001256
    data: 0.006067
    data: 0.031192
    data: 0.020698
    data: -0.034643
    data: -0.020845
    data: 0.037151
    data: 0.035968
    data: 0.012167
    data: -0.002648
    data: 0.005755
    data: -0.004525
    data: -0.009970
    data: 0.008783
    data: 0.029179
    data: 0.000485
    data: 0.009060
    data: 0.016981
    data: 0.026509
    data: -0.009839
    data: 0.004571
    data: 0.008510
    data: -0.003289
    data: -0.023884
    data: -0.022947
    data: 0.004459
    data: 0.025711
    data: 0.027150
    data: 0.012770
    data: 0.011051
    data: 0.012010
    data: -0.004697
    data: -0.004070
    data: -0.015494
    data: -0.015263
    data: 0.008892
    data: 0.003902
    data: 0.010951
    data: -0.013259
    data: 0.002315
    data: 0.006279
    data: 0.007646
    data: 0.002240
    data: -0.011241
    data: 0.026546
    data: 0.000928
    data: -0.027140
    data: -0.025293
    data: 0.004259
    data: 0.018868
    data: 0.041569
    data: -0.010883
    data: 0.025492
    data: 0.005999
    data: 0.017406
    data: 0.024322
    data: -0.014133
    data: -0.010177
    data: -0.023038
    data: -0.029745
    data: 0.002884
    data: -0.009245
    data: -0.011576
    data: 0.019684
    data: 0.011082
    data: 0.016695
    data: 0.006069
    data: -0.002737
    data: -0.013114
    data: -0.017360
    data: -0.021145
    data: -0.001574
    data: -0.013318
    data: -0.006630
    data: -0.010343
    data: 0.003626
    data: 0.011911
    data: -0.005988
    data: 0.004159
    data: -0.011435
    data: -0.026488
    data: -0.018779
    data: -0.016066
    data: -0.003889
    data: -0.001659
    data: -0.013344
    data: -0.023740
    data: 0.003934
    data: -0.012128
    data: -0.002169
    data: -0.031220
    data: -0.012364
    data: -0.021956
    data: -0.025320
    data: -0.020345
    data: -0.018100
    data: -0.000067
    data: -0.014000
    data: -0.004483
    data: -0.004814
    data: -0.011955
    data: -0.030734
    data: -0.054602
    data: -0.056549
    data: -0.039343
    data: -0.019459
    data: -0.000900
    data: -0.006723
    data: -0.014119
    data: 0.007269
    data: 0.012678
    data: 0.001299
    data: -0.018921
    data: -0.082620
    data: -0.145452
    data: -0.112372
    data: -0.010243
    data: 0.011157
    data: 0.011429
    data: -0.001087
    data: -0.003463
    data: 0.002888
    data: -0.008461
    data: -0.010423
    data: -0.069134
    data: -0.157896
    data: -0.141044
    data: -0.029923
    data: 0.013219
    data: -0.001449
    data: -0.012247
    data: 0.013040
    data: 0.007455
    data: -0.005525
    data: 0.000136
    data: -0.009539
    data: -0.058742
    data: -0.048197
    data: -0.013493
    data: 0.015694
    data: -0.014134
    data: 0.004984
    data: 0.016232
    data: 0.009293
    data: -0.014905
    data: -0.016597
    data: -0.005467
    data: 0.005055
    data: 0.007180
    data: 0.003623
    data: -0.001257
    data: 0.013631
    data: 0.001688
    data: 0.012715
    data: -0.003152
    data: -0.009568
    data: 0.005735
    data: -0.010130
    data: 0.006548
    data: -0.022321
    data: -0.000292
    data: -0.012478
    data: 0.002309
    data: 0.008213
    data: -0.000162
    data: 0.033380
    data: 0.013194
    data: -0.012768
    data: -0.011458
    data: 0.022787
    data: 0.027256
    data: 0.049566
    data: -0.008729
    data: 0.031727
    data: 0.012338
    data: 0.023785
    data: 0.025553
    data: -0.010153
    data: -0.001297
    data: -0.012433
    data: -0.011225
    data: 0.014412
    data: 0.014561
    data: -0.000798
    data: 0.027919
    data: 0.025902
    data: 0.035173
    data: 0.019123
    data: 0.013237
    data: 0.004305
    data: -0.007503
    data: -0.009331
    data: 0.008761
    data: 0.013947
    data: 0.006340
    data: 0.009970
    data: 0.024282
    data: 0.030424
    data: 0.007601
    data: 0.016593
    data: 0.006711
    data: -0.016972
    data: -0.006432
    data: 0.006035
    data: 0.034357
    data: 0.024657
    data: 0.005885
    data: -0.003471
    data: 0.019418
    data: 0.007635
    data: 0.012739
    data: -0.015963
    data: -0.007648
    data: -0.018707
    data: -0.008937
    data: 0.014845
    data: 0.010989
    data: 0.023397
    data: 0.005009
    data: 0.011259
    data: 0.010225
    data: 0.003470
    data: -0.019439
    data: -0.057340
    data: -0.070539
    data: -0.050478
    data: -0.005115
    data: 0.021778
    data: 0.010334
    data: -0.005790
    data: 0.010734
    data: 0.026405
    data: 0.015495
    data: -0.011407
    data: -0.099438
    data: -0.181365
    data: -0.141567
    data: -0.022451
    data: 0.010775
    data: 0.018535
    data: 0.010211
    data: -0.000842
    data: 0.017647
    data: 0.015459
    data: 0.011315
    data: -0.079172
    data: -0.195577
    data: -0.174633
    data: -0.048911
    data: 0.010791
    data: 0.007874
    data: -0.005530
    data: 0.007150
    data: 0.017615
    data: 0.015642
    data: 0.033500
    data: -0.005315
    data: -0.075339
    data: -0.068139
    data: -0.025472
    data: 0.010007
    data: -0.011457
    data: 0.000462
    data: -0.002181
    data: 0.015379
    data: 0.006060
    data: 0.012081
    data: 0.022263
    data: 0.014473
    data: 0.005014
    data: -0.000124
    data: 0.004525
    data: 0.009233
    data: -0.005545
    data: 0.001229
    data: 0.004093
    data: 0.005474
    data: 0.029444
    data: 0.019912
    data: 0.031831
    data: -0.009422
    data: 0.005589
    data: -0.002762
    data: 0.000317
    data: 0.001107
    data: -0.007245
    data: 0.004375
    data: -0.008501
    data: 0.004547
    data: -0.003945
    data: 0.007091
    data: -0.004787
    data: 0.005243
    data: -0.007067
    data: -0.008533
    data: -0.001821
    data: -0.001914
    data: 0.007569
    data: -0.001035
    data: 0.000598
    data: -0.013064
    data: 0.010789
    data: -0.000971
    data: 0.008240
    data: 0.011819
    data: 0.011999
    data: -0.002877
    data: 0.004360
    data: 0.004875
    data: -0.003981
    data: -0.017096
    data: -0.025358
    data: -0.002198
    data: -0.005950
    data: 0.025711
    data: 0.018881
    data: 0.019112
    data: 0.000780
    data: -0.005972
    data: 0.008656
    data: -0.001175
    data: -0.012470
    data: -0.038277
    data: -0.033084
    data: 0.007610
    data: 0.043872
    data: 0.036751
    data: 0.009397
    data: -0.004071
    data: 0.009612
    data: -0.001907
    data: -0.014349
    data: -0.020439
    data: -0.047856
    data: -0.053587
    data: 0.025875
    data: 0.063514
    data: 0.031809
    data: 0.009976
    data: -0.007955
    data: 0.016943
    data: 0.006875
    data: -0.016902
    data: -0.020397
    data: -0.060340
    data: -0.072904
    data: 0.013479
    data: 0.086487
    data: 0.046975
    data: 0.020583
    data: 0.003210
    data: 0.030226
    data: 0.014248
    data: -0.010957
    data: -0.023899
    data: -0.044669
    data: -0.044083
    data: -0.030339
    data: 0.047688
    data: 0.049492
    data: 0.015455
    data: 0.013071
    data: 0.025082
    data: 0.004703
    data: -0.010203
    data: -0.019641
    data: -0.010082
    data: -0.002378
    data: -0.039154
    data: -0.007660
    data: -0.000629
    data: -0.001927
    data: 0.007558
    data: 0.021778
    data: 0.004569
    data: -0.010760
    data: -0.024316
    data: -0.015756
    data: 0.011703
    data: -0.007419
    data: -0.022412
    data: 0.010983
    data: -0.011214
    data: -0.004229
    data: 0.014403
    data: 0.005332
    data: -0.003422
    data: -0.009660
    data: -0.006602
    data: 0.014085
    data: -0.011048
    data: -0.029868
    data: -0.010988
    data: 0.012566
    data: -0.002869
    data: 0.001603
    data: -0.001684
    data: 0.001542
    data: 0.001206
    data: 0.008328
    data: 0.006684
    data: -0.017573
    data: -0.016316
    data: -0.016400
    data: -0.015587
    data: -0.011551
    data: -0.016095
    data: -0.009921
    data: -0.014453
    data: 0.000924
    data: -0.004901
    data: 0.007019
    data: -0.004678
    data: 0.002495
    data: -0.013289
    data: -0.003358
    data: 0.012752
    data: 0.013431
    data: -0.002536
    data: -0.010281
    data: -0.007035
    data: -0.010642
    data: 0.017425
    data: 0.000687
    data: 0.007972
    data: 0.010907
    data: 0.020854
    data: 0.007250
    data: 0.012895
    data: -0.006826
    data: -0.017375
    data: -0.027104
    data: -0.033006
    data: -0.002381
    data: 0.000447
    data: 0.028453
    data: 0.026291
    data: 0.030306
    data: -0.000853
    data: 0.002143
    data: -0.004369
    data: -0.012877
    data: -0.012710
    data: -0.038608
    data: -0.032685
    data: 0.017420
    data: 0.052249
    data: 0.046442
    data: 0.010780
    data: -0.008288
    data: 0.001435
    data: -0.015547
    data: -0.019563
    data: -0.016751
    data: -0.046629
    data: -0.055231
    data: 0.031198
    data: 0.080519
    data: 0.049410
    data: 0.016201
    data: -0.014186
    data: 0.009939
    data: -0.008493
    data: -0.022927
    data: -0.017567
    data: -0.051784
    data: -0.080255
    data: 0.009696
    data: 0.108810
    data: 0.077929
    data: 0.030413
    data: -0.000158
    data: 0.021140
    data: -0.001140
    data: -0.022540
    data: -0.021503
    data: -0.044963
    data: -0.052983
    data: -0.038515
    data: 0.055873
    data: 0.082260
    data: 0.028577
    data: 0.004669
    data: 0.018048
    data: -0.008450
    data: -0.013490
    data: -0.011319
    data: -0.008827
    data: -0.010065
    data: -0.042794
    data: -0.009296
    data: 0.028345
    data: 0.009950
    data: 0.010531
    data: 0.019848
    data: -0.007405
    data: -0.014424
    data: -0.020088
    data: -0.012965
    data: 0.006624
    data: -0.002573
    data: -0.019717
    data: 0.031239
    data: 0.010992
    data: 0.017204
    data: 0.026027
    data: -0.011642
    data: -0.008526
    data: -0.010755
    data: -0.008595
    data: 0.010497
    data: -0.000493
    data: -0.016931
    data: 0.003804
    data: 0.029085
    data: 0.010793
    data: 0.009256
    data: -0.006110
    data: -0.002236
    data: -0.002633
    data: 0.006953
    data: 0.009410
    data: -0.010912
    data: -0.015463
    data: -0.002516
    data: -0.003024
    data: -0.001299
    data: -0.006019
    data: 0.002659
    data: -0.011406
    data: -0.001294
    data: -0.013602
    data: -0.004535
    data: -0.022374
    data: -0.010568
    data: -0.025088
    data: -0.016048
    data: 0.003188
    data: 0.010037
    data: 0.009965
    data: -0.001157
    data: -0.010157
    data: -0.021450
    data: 0.005998
    data: -0.011023
    data: -0.000742
    data: 0.003022
    data: 0.011379
    data: -0.003278
    data: 0.011266
    data: 0.004778
    data: -0.005691
    data: -0.025350
    data: -0.040385
    data: -0.016070
    data: -0.016033
    data: 0.016991
    data: 0.021668
    data: 0.025632
    data: -0.012606
    data: -0.009754
    data: 0.015054
    data: 0.004292
    data: -0.004205
    data: -0.043956
    data: -0.052517
    data: -0.004062
    data: 0.045055
    data: 0.052581
    data: 0.006006
    data: -0.018950
    data: -0.012505
    data: 0.005144
    data: -0.002228
    data: -0.001758
    data: -0.044312
    data: -0.076248
    data: 0.009176
    data: 0.077658
    data: 0.049651
    data: 0.021756
    data: -0.017015
    data: -0.010939
    data: 0.009941
    data: -0.012019
    data: -0.013941
    data: -0.053330
    data: -0.098658
    data: -0.011720
    data: 0.111276
    data: 0.086865
    data: 0.035510
    data: -0.002812
    data: -0.005101
    data: 0.008061
    data: -0.011512
    data: -0.013508
    data: -0.040690
    data: -0.059937
    data: -0.054223
    data: 0.061356
    data: 0.092844
    data: 0.031030
    data: 0.003009
    data: 0.000483
    data: 0.001383
    data: -0.001645
    data: -0.004626
    data: -0.006381
    data: -0.014509
    data: -0.047485
    data: -0.006231
    data: 0.030467
    data: 0.012478
    data: 0.009612
    data: 0.002628
    data: 0.004659
    data: -0.001056
    data: -0.011217
    data: -0.008950
    data: 0.007552
    data: -0.005063
    data: -0.011257
    data: 0.031530
    data: 0.018501
    data: 0.017344
    data: 0.017224
    data: -0.000201
    data: -0.001591
    data: -0.005353
    data: -0.009782
    data: 0.010305
    data: 0.002403
    data: -0.011615
    data: -0.002049
    data: 0.033052
    data: 0.009975
    data: 0.006571
    data: -0.003507
    data: 0.004679
    data: -0.001947
    data: 0.008336
    data: 0.009252
    data: -0.013036
    data: -0.005978
    data: -0.003922
    data: 0.002176
    data: 0.002907
    data: -0.004174
    data: -0.035049
    data: -0.057549
    data: -0.054613
    data: -0.025303
    data: 0.017972
    data: 0.049709
    data: 0.045886
    data: 0.020529
    data: 0.015281
    data: -0.005642
    data: -0.010488
    data: -0.041887
    data: -0.086887
    data: -0.083630
    data: -0.044219
    data: 0.020960
    data: 0.062222
    data: 0.088138
    data: 0.061780
    data: 0.031333
    data: 0.009499
    data: -0.000032
    data: -0.061393
    data: -0.092380
    data: -0.098009
    data: -0.065740
    data: -0.005009
    data: 0.069123
    data: 0.101872
    data: 0.097444
    data: 0.063925
    data: 0.027283
    data: 0.001239
    data: -0.048378
    data: -0.101044
    data: -0.101473
    data: -0.093194
    data: -0.032733
    data: 0.044255
    data: 0.103247
    data: 0.086420
    data: 0.068796
    data: 0.022868
    data: 0.000989
    data: -0.026119
    data: -0.040235
    data: -0.079143
    data: -0.060063
    data: -0.032312
    data: 0.004006
    data: 0.067320
    data: 0.058783
    data: 0.046401
    data: 0.015727
    data: -0.014050
    data: 0.008753
    data: 0.000516
    data: -0.009641
    data: -0.024073
    data: -0.018217
    data: -0.015062
    data: 0.008064
    data: 0.013911
    data: 0.026452
    data: 0.017407
    data: -0.011931
    data: 0.038817
    data: 0.043700
    data: 0.064106
    data: 0.016596
    data: -0.014932
    data: -0.051466
    data: -0.047636
    data: -0.023237
    data: -0.006950
    data: 0.003941
    data: 0.001854
    data: 0.071034
    data: 0.089495
    data: 0.118040
    data: 0.055322
    data: -0.005326
    data: -0.081362
    data: -0.099919
    data: -0.085107
    data: -0.041384
    data: -0.010355
    data: -0.000059
    data: 0.075644
    data: 0.106873
    data: 0.118071
    data: 0.080770
    data: 0.003300
    data: -0.075106
    data: -0.113459
    data: -0.111726
    data: -0.068921
    data: -0.017494
    data: 0.003380
    data: 0.053105
    data: 0.085818
    data: 0.096491
    data: 0.075107
    data: 0.017436
    data: -0.058366
    data: -0.093168
    data: -0.101348
    data: -0.053479
    data: -0.011028
    data: 0.014234
    data: 0.026616
    data: 0.037544
    data: 0.055987
    data: 0.047042
    data: 0.025087
    data: -0.029128
    data: -0.048344
    data: -0.059940
    data: -0.025490
    data: -0.013956
    data: 0.003750
    data: -0.020592
    data: -0.043069
    data: -0.053617
    data: -0.028240
    data: 0.009385
    data: 0.040592
    data: 0.045781
    data: 0.022946
    data: 0.020156
    data: -0.004646
    data: -0.002277
    data: -0.031011
    data: -0.071935
    data: -0.085048
    data: -0.047166
    data: 0.011786
    data: 0.056068
    data: 0.079120
    data: 0.057852
    data: 0.030929
    data: 0.000186
    data: -0.004254
    data: -0.054318
    data: -0.081359
    data: -0.101870
    data: -0.070925
    data: -0.013756
    data: 0.062070
    data: 0.097097
    data: 0.106749
    data: 0.061825
    data: 0.023094
    data: -0.001256
    data: -0.037836
    data: -0.090242
    data: -0.098675
    data: -0.092636
    data: -0.030321
    data: 0.042887
    data: 0.103072
    data: 0.093372
    data: 0.071717
    data: 0.018113
    data: -0.000833
    data: -0.023878
    data: -0.041201
    data: -0.073475
    data: -0.054752
    data: -0.014441
    data: 0.014572
    data: 0.074554
    data: 0.065722
    data: 0.046671
    data: 0.010245
    data: -0.009217
    data: 0.001008
    data: -0.006093
    data: -0.011851
    data: -0.014038
    data: -0.004260
    data: 0.002528
    data: 0.011649
    data: 0.011900
    data: 0.028912
    data: 0.015847
    data: -0.013479
    data: 0.024865
    data: 0.030584
    data: 0.059604
    data: 0.027222
    data: 0.003633
    data: -0.029475
    data: -0.044818
    data: -0.024693
    data: -0.009326
    data: 0.002316
    data: 0.006295
    data: 0.051468
    data: 0.074989
    data: 0.109187
    data: 0.063055
    data: 0.008965
    data: -0.072005
    data: -0.101332
    data: -0.086654
    data: -0.044286
    data: -0.007486
    data: 0.004877
    data: 0.070395
    data: 0.100914
    data: 0.118995
    data: 0.080399
    data: -0.001619
    data: -0.081031
    data: -0.114014
    data: -0.112520
    data: -0.068416
    data: -0.011981
    data: 0.010280
    data: 0.046710
    data: 0.081709
    data: 0.093441
    data: 0.070549
    data: 0.011703
    data: -0.063658
    data: -0.096496
    data: -0.105689
    data: -0.060078
    data: -0.006793
    data: 0.019102
    data: 0.025687
    data: 0.039286
    data: 0.058976
    data: 0.041721
    data: 0.013708
    data: -0.035008
    data: -0.053030
    data: -0.067832
    data: -0.030570
    data: -0.013899
    data: 0.007409
    data: -0.005737
    data: -0.024135
    data: -0.034464
    data: -0.020477
    data: 0.007967
    data: 0.025394
    data: 0.024075
    data: 0.006189
    data: 0.015001
    data: 0.004571
    data: 0.008290
    data: -0.013462
    data: -0.047625
    data: -0.057183
    data: -0.028158
    data: 0.011315
    data: 0.039905
    data: 0.054342
    data: 0.035107
    data: 0.013817
    data: -0.007883
    data: 0.000449
    data: -0.039166
    data: -0.056779
    data: -0.069245
    data: -0.049330
    data: -0.012737
    data: 0.046142
    data: 0.074775
    data: 0.078730
    data: 0.044922
    data: 0.012832
    data: 0.000931
    data: -0.034570
    data: -0.070974
    data: -0.078721
    data: -0.073175
    data: -0.020972
    data: 0.038284
    data: 0.086453
    data: 0.069432
    data: 0.052702
    data: 0.006124
    data: 0.001376
    data: -0.034925
    data: -0.039596
    data: -0.066431
    data: -0.040705
    data: -0.002963
    data: 0.027270
    data: 0.074743
    data: 0.051123
    data: 0.035113
    data: 0.001254
    data: -0.014306
    data: -0.021279
    data: -0.017524
    data: -0.018851
    data: -0.011662
    data: 0.007692
    data: 0.013833
    data: 0.022041
    data: 0.011071
    data: 0.018229
    data: 0.006030
    data: -0.018755
    data: -0.000015
    data: 0.014415
    data: 0.039596
    data: 0.020859
    data: 0.015596
    data: -0.010844
    data: -0.026386
    data: -0.016556
    data: -0.009048
    data: -0.004372
    data: -0.002664
    data: 0.020531
    data: 0.044667
    data: 0.079603
    data: 0.049950
    data: 0.010031
    data: -0.051459
    data: -0.077149
    data: -0.065659
    data: -0.032971
    data: -0.007970
    data: 0.002502
    data: 0.050300
    data: 0.072882
    data: 0.091499
    data: 0.056859
    data: -0.006694
    data: -0.061938
    data: -0.083597
    data: -0.079906
    data: -0.044011
    data: -0.007175
    data: 0.005738
    data: 0.031120
    data: 0.062472
    data: 0.069486
    data: 0.050152
    data: 0.000506
    data: -0.055021
    data: -0.080082
    data: -0.079308
    data: -0.039993
    data: -0.002365
    data: 0.010825
    data: 0.018484
    data: 0.029108
    data: 0.043615
    data: 0.018579
    data: -0.001787
    data: -0.036664
    data: -0.041743
    data: -0.055482
    data: -0.015128
    data: -0.004927
    data: 0.008390
    data: -0.000372
    data: -0.000716
    data: -0.001154
    data: -0.002204
    data: -0.002170
    data: -0.003074
    data: -0.002820
    data: -0.002223
    data: -0.001309
    data: -0.000421
    data: -0.001181
    data: -0.000447
    data: -0.002003
    data: -0.001974
    data: -0.003435
    data: -0.002899
    data: -0.002557
    data: -0.002724
    data: -0.002034
    data: -0.002611
    data: -0.002091
    data: -0.001763
    data: -0.002124
    data: -0.002434
    data: -0.002966
    data: -0.002852
    data: -0.004060
    data: -0.003984
    data: -0.003800
    data: -0.002641
    data: -0.002796
    data: -0.002317
    data: -0.001996
    data: -0.000879
    data: -0.002451
    data: -0.002671
    data: -0.003240
    data: -0.003296
    data: -0.004214
    data: -0.004099
    data: -0.004638
    data: -0.003737
    data: -0.003521
    data: -0.001954
    data: -0.002190
    data: -0.002487
    data: -0.003224
    data: -0.003625
    data: -0.005239
    data: -0.005768
    data: -0.005198
    data: -0.004326
    data: -0.005611
    data: -0.004449
    data: -0.003903
    data: -0.001133
    data: -0.003288
    data: -0.003264
    data: -0.004533
    data: -0.006133
    data: -0.006293
    data: -0.005111
    data: -0.005125
    data: -0.005451
    data: -0.005224
    data: -0.003876
    data: -0.000418
    data: -0.002155
    data: -0.002487
    data: -0.003497
    data: -0.005143
    data: -0.006318
    data: -0.004284
    data: -0.005759
    data: -0.005649
    data: -0.005111
    data: -0.003106
    data: -0.000563
    data: -0.000728
    data: -0.001313
    data: -0.004095
    data: -0.003907
    data: -0.005021
    data: -0.005050
    data: -0.005055
    data: -0.005777
    data: -0.005152
    data: -0.003878
    data: 0.000050
    data: -0.000536
    data: -0.001703
    data: -0.002709
    data: -0.004040
    data: -0.004530
    data: -0.005073
    data: -0.006120
    data: -0.004887
    data: -0.004858
    data: -0.003970
    data: 0.001210
    data: -0.000518
    data: -0.001243
    data: -0.002240
    data: -0.002986
    data: -0.003945
    data: -0.004396
    data: -0.003677
    data: -0.003552
    data: -0.004017
    data: -0.003139
    data: 0.002275
    data: 0.000740
    data: 0.000275
    data: -0.000504
    data: -0.001406
    data: -0.001921
    data: -0.001818
    data: -0.002779
    data: -0.003399
    data: -0.001508
    data: -0.000655
    data: -0.001197
    data: -0.001525
    data: -0.001787
    data: -0.003132
    data: -0.002668
    data: -0.004687
    data: -0.004617
    data: -0.004565
    data: -0.005704
    data: -0.005059
    data: -0.004713
    data: -0.000118
    data: -0.001353
    data: -0.001991
    data: -0.003116
    data: -0.001643
    data: -0.002714
    data: -0.004270
    data: -0.004347
    data: -0.004628
    data: -0.004015
    data: -0.005089
    data: -0.000316
    data: -0.001953
    data: -0.000910
    data: -0.000192
    data: -0.001773
    data: -0.002552
    data: -0.002555
    data: -0.002122
    data: -0.002044
    data: -0.002858
    data: -0.003789
    data: 0.001043
    data: -0.000852
    data: -0.000746
    data: -0.002070
    data: 0.000121
    data: -0.000688
    data: -0.002068
    data: -0.003867
    data: -0.002288
    data: -0.003366
    data: -0.002252
    data: 0.000812
    data: 0.000539
    data: -0.000905
    data: -0.000997
    data: -0.000531
    data: -0.002185
    data: -0.002437
    data: -0.001798
    data: -0.003782
    data: -0.002359
    data: -0.002852
    data: 0.001630
    data: -0.000741
    data: 0.001241
    data: 0.000681
    data: -0.001270
    data: -0.000786
    data: -0.001189
    data: -0.001502
    data: -0.001401
    data: -0.001040
    data: -0.001674
    data: 0.002660
    data: 0.001383
    data: 0.001948
    data: 0.002411
    data: 0.001679
    data: -0.000604
    data: 0.001386
    data: -0.001004
    data: 0.000131
    data: -0.001151
    data: 0.000183
    data: 0.002455
    data: 0.001933
    data: 0.002494
    data: 0.000737
    data: 0.002319
    data: 0.000728
    data: 0.001482
    data: 0.000543
    data: 0.000337
    data: 0.000315
    data: -0.000170
    data: 0.001591
    data: 0.001761
    data: 0.001338
    data: 0.000853
    data: 0.001161
    data: 0.001609
    data: 0.001787
    data: -0.000319
    data: 0.000762
    data: 0.001625
    data: 0.001335
    data: 0.002613
    data: 0.001070
    data: 0.001746
    data: 0.001600
    data: 0.001998
    data: 0.002095
    data: 0.001499
    data: 0.002740
    data: 0.003485
    data: 0.002527
    data: 0.002603
    data: 0.002846
    data: 0.002165
    data: 0.003176
    data: 0.003063
    data: 0.003337
    data: 0.002966
    data: 0.003459
    data: 0.002787
    data: 0.002246
    data: 0.004570
    data: 0.004010
    data: 0.000707
    data: 0.001233
    data: 0.001507
    data: 0.001369
    data: 0.000875
    data: -0.000197
    data: 0.000783
    data: 0.000089
    data: -0.000881
    data: -0.000509
    data: -0.000410
    data: 0.001969
    data: 0.001240
    data: 0.001745
    data: 0.001770
    data: 0.003309
    data: 0.002678
    data: 0.001404
    data: 0.001460
    data: 0.001350
    data: 0.001354
    data: -0.000097
    data: 0.001769
    data: 0.001605
    data: 0.002901
    data: 0.004248
    data: 0.003722
    data: 0.003546
    data: 0.003966
    data: 0.004785
    data: 0.003702
    data: 0.002700
    data: 0.002194
    data: 0.002131
    data: 0.002812
    data: 0.003401
    data: 0.002588
    data: 0.003947
    data: 0.004445
    data: 0.003929
    data: 0.002101
    data: 0.003797
    data: 0.002309
    data: 0.002967
    data: 0.003338
    data: 0.003788
    data: 0.002811
    data: 0.003018
    data: 0.003725
    data: 0.002855
    data: 0.003448
    data: 0.004422
    data: 0.002444
    data: 0.004093
    data: 0.002422
    data: 0.003474
    data: 0.001603
    data: 0.004442
    data: 0.004830
    data: 0.003475
    data: 0.004870
    data: 0.004359
    data: 0.004433
    data: 0.003927
    data: 0.003737
    data: 0.003049
    data: 0.003234
    data: 0.003061
    data: 0.004356
    data: 0.005253
    data: 0.005001
    data: 0.003624
    data: 0.006330
    data: 0.004327
    data: 0.005137
    data: 0.003952
    data: 0.005125
    data: 0.002569
    data: 0.003137
    data: 0.003878
    data: 0.002738
    data: 0.004128
    data: 0.004774
    data: 0.005653
    data: 0.005323
    data: 0.005143
    data: 0.004790
    data: 0.004221
    data: 0.001380
    data: 0.001483
    data: 0.001510
    data: 0.002546
    data: 0.003219
    data: 0.003337
    data: 0.004403
    data: 0.003009
    data: 0.004357
    data: 0.005591
    data: 0.004497
    data: 0.000745
    data: -0.000272
    data: 0.000945
    data: 0.001881
    data: 0.002827
    data: 0.003221
    data: 0.003127
    data: 0.004565
    data: 0.004833
    data: 0.004661
    data: 0.004823
    data: 0.000731
    data: -0.000227
    data: 0.001133
    data: 0.001720
    data: 0.002304
    data: 0.002905
    data: 0.004580
    data: 0.004001
    data: 0.003239
    data: 0.004657
    data: 0.004477
    data: -0.000071
    data: 0.004803
    data: 0.020711
    data: 0.015906
    data: 0.004978
    data: 0.026440
    data: 0.026982
    data: -0.001062
    data: 0.006159
    data: 0.010107
    data: 0.003622
    data: 0.020151
    data: 0.013924
    data: 0.023948
    data: 0.012684
    data: 0.003214
    data: 0.011855
    data: 0.025921
    data: 0.013733
    data: 0.005289
    data: 0.024195
    data: 0.012323
    data: 0.023343
    data: 0.020281
    data: 0.033699
    data: 0.028028
    data: 0.002030
    data: -0.002361
    data: 0.025043
    data: 0.027637
    data: 0.003180
    data: 0.007933
    data: 0.000743
    data: 0.022425
    data: 0.033177
    data: 0.018341
    data: 0.025109
    data: 0.012614
    data: 0.008361
    data: 0.016311
    data: 0.017567
    data: -0.003397
    data: -0.001113
    data: 0.003044
    data: 0.018383
    data: 0.027126
    data: 0.006629
    data: 0.022129
    data: 0.025699
    data: 0.005360
    data: 0.006858
    data: 0.005091
    data: -0.009162
    data: 0.004820
    data: 0.014097
    data: 0.030345
    data: 0.021454
    data: 0.022798
    data: 0.019745
    data: 0.027244
    data: 0.018246
    data: -0.000080
    data: 0.009531
    data: 0.013233
    data: -0.001529
    data: -0.000966
    data: 0.027666
    data: 0.024638
    data: 0.017286
    data: 0.025845
    data: 0.022576
    data: 0.006785
    data: 0.000860
    data: 0.012250
    data: 0.016541
    data: -0.009004
    data: 0.002462
    data: 0.030696
    data: 0.025628
    data: 0.020782
    data: 0.013123
    data: 0.009153
    data: 0.002531
    data: 0.010911
    data: 0.006455
    data: 0.006860
    data: -0.007480
    data: -0.003501
    data: 0.021050
    data: 0.018855
    data: 0.018171
    data: -0.006368
    data: 0.000588
    data: 0.018928
    data: 0.005133
    data: 0.001860
    data: 0.005555
    data: -0.005343
    data: -0.015614
    data: 0.017707
    data: 0.030863
    data: 0.012496
    data: -0.000866
    data: 0.004481
    data: 0.024538
    data: 0.004302
    data: -0.004466
    data: 0.001542
    data: -0.000876
    data: -0.015795
    data: 0.013974
    data: 0.013729
    data: 0.012613
    data: 0.023275
    data: 0.022955
    data: -0.003509
    data: -0.003980
    data: -0.009464
    data: -0.008896
    data: 0.008303
    data: -0.014195
    data: -0.019863
    data: -0.026115
    data: -0.018903
    data: -0.026709
    data: -0.032032
    data: -0.009155
    data: -0.012310
    data: -0.043461
    data: -0.031987
    data: -0.020350
    data: -0.016915
    data: -0.008872
    data: -0.024355
    data: -0.021905
    data: -0.034079
    data: -0.043610
    data: -0.038616
    data: -0.024302
    data: -0.036055
    data: -0.039276
    data: -0.015317
    data: -0.016740
    data: -0.012668
    data: -0.023026
    data: -0.022270
    data: -0.033455
    data: -0.061759
    data: -0.066344
    data: -0.037216
    data: -0.034776
    data: -0.048251
    data: -0.036093
    data: -0.029927
    data: -0.021366
    data: -0.017828
    data: -0.046663
    data: -0.048838
    data: -0.059284
    data: -0.061554
    data: -0.051259
    data: -0.048602
    data: -0.057795
    data: -0.048624
    data: -0.029875
    data: -0.029633
    data: -0.027468
    data: -0.061999
    data: -0.054253
    data: -0.047699
    data: -0.064403
    data: -0.057697
    data: -0.052056
    data: -0.057166
    data: -0.037798
    data: -0.018449
    data: -0.019999
    data: -0.035744
    data: -0.044799
    data: -0.055024
    data: -0.044366
    data: -0.049691
    data: -0.057153
    data: -0.040517
    data: -0.030663
    data: -0.038982
    data: -0.030460
    data: -0.018726
    data: -0.032036
    data: -0.048632
    data: -0.050402
    data: -0.049326
    data: -0.057652
    data: -0.046378
    data: -0.029665
    data: -0.020082
    data: -0.043851
    data: -0.024433
    data: -0.014189
    data: -0.030665
    data: -0.049054
    data: -0.065282
    data: -0.061987
    data: -0.056008
    data: -0.036262
    data: -0.031445
    data: -0.028434
    data: -0.041368
    data: -0.030660
    data: -0.016965
    data: -0.026679
    data: -0.042340
    data: -0.074971
    data: -0.056376
    data: -0.028223
    data: -0.032990
    data: -0.030122
    data: -0.022427
    data: -0.033895
    data: -0.035966
    data: -0.013466
    data: -0.006563
    data: -0.030417
    data: -0.048863
    data: -0.036030
    data: -0.011032
    data: -0.025279
    data: -0.032991
    data: -0.021587
    data: -0.024284
    data: -0.027643
    data: -0.006439
    data: -0.011020
    data: -0.018288
    data: -0.007144
    data: -0.004823
    data: -0.028671
    data: -0.026291
    data: -0.032562
    data: -0.026075
    data: -0.005469
    data: -0.014671
    data: -0.004545
    data: -0.000016
    data: 0.015857
    data: 0.015904
    data: 0.025832
    data: 0.046941
    data: 0.043189
    data: 0.019487
    data: 0.027203
    data: 0.027383
    data: 0.024024
    data: 0.006113
    data: 0.005884
    data: 0.019006
    data: 0.022409
    data: 0.030952
    data: 0.041559
    data: 0.046123
    data: 0.041045
    data: 0.036292
    data: 0.046264
    data: 0.034194
    data: 0.008072
    data: 0.015196
    data: 0.030761
    data: 0.032540
    data: 0.027801
    data: 0.034950
    data: 0.055993
    data: 0.049522
    data: 0.039601
    data: 0.040462
    data: 0.028283
    data: 0.005487
    data: 0.018711
    data: 0.015563
    data: 0.020500
    data: 0.024142
    data: 0.037538
    data: 0.050097
    data: 0.047824
    data: 0.036531
    data: 0.030948
    data: 0.031487
    data: 0.001571
    data: 0.016041
    data: 0.000410
    data: 0.013334
    data: 0.028100
    data: 0.026879
    data: 0.040772
    data: 0.045475
    data: 0.035823
    data: 0.036287
    data: 0.038572
    data: 0.009752
    data: 0.007856
    data: 0.012592
    data: 0.009664
    data: 0.027866
    data: 0.037461
    data: 0.036529
    data: 0.048174
    data: 0.046068
    data: 0.032817
    data: 0.028717
    data: 0.010928
    data: 0.008745
    data: 0.004407
    data: 0.009125
    data: 0.023185
    data: 0.027705
    data: 0.041083
    data: 0.043326
    data: 0.051958
    data: 0.029113
    data: 0.034855
    data: 0.013500
    data: 0.008241
    data: 0.002921
    data: -0.001622
    data: 0.010068
    data: 0.018755
    data: 0.040271
    data: 0.040027
    data: 0.038003
    data: 0.027172
    data: 0.028638
    data: 0.002006
    data: 0.002029
    data: -0.000662
    data: -0.017885
    data: 0.005858
    data: 0.025780
    data: 0.024859
    data: 0.028514
    data: 0.029903
    data: 0.019475
    data: 0.013920
    data: -0.001578
    data: 0.011152
    data: -0.001533
    data: -0.009208
    data: 0.005783
    data: 0.025059
    data: 0.020970
    data: 0.018696
    data: 0.019365
    data: 0.010357
    data: 0.005344
    data: -0.002464
    data: -0.001069
    data: -0.001450
    data: 0.010774
    data: 0.016823
    data: 0.000220
    data: 0.012335
    data: 0.007211
