layer {
  name: "backbone.features.12.sc_temp"
  type: "Scale"
  bottom: "backbone.features.12.bn_temp"
  top: "backbone.features.12.sc_temp"
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 1.0
    decay_mult: 0.0
  }
  scale_param {
    filler {
      type: "constant"
      value: 1.0
    }
    bias_term: true
    bias_filler {
      type: "constant"
      value: 0.0
    }
  }
}
