layer {
  name: "backbone.features.4_srch"
  type: "Convolution"
  bottom: "relu1_srch"
  top: "backbone.features.4_srch"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 256
    pad: 0
    kernel_size: 5
    # group: 2
  }
}
