layer {
  name: "backbone.features.14_temp"
  type: "Convolution"
  bottom: "relu4_temp"
  top: "backbone.features.14_temp"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 256
    pad: 0
    kernel_size: 3
    # group: 2
  }
}
