layer {
  name: "rpn_head.loc.conv_kernel.0"
  type: "Convolution"
  bottom: "backbone.features.15.sc_temp"
  top: "rpn_head.loc.conv_kernel.0"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    bias_term: false
    num_output: 256
    pad: 0
    kernel_size: 3
    # group: 2
  }
}
