layer {
  name: "backbone.features.0_temp"
  type: "Convolution"
  bottom: "template"
  top: "backbone.features.0_temp"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 96
    kernel_size: 11
    stride: 2
  }
}
