layer {
  name: "backbone.features.9.bn_srch"
  type: "BatchNorm"
  bottom: "backbone.features.8_srch"
  top: "backbone.features.9.bn_srch"
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  batch_norm_param {
    moving_average_fraction: 0.999000012875
    eps: 0.0010000000475
  }
}
