layer {
  name: "rpn_head.loc.head.1.sc"
  type: "Scale"
  bottom: "rpn_head.loc.head.1.bn"
  top: "rpn_head.loc.head.1.sc"
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 1.0
    decay_mult: 0.0
  }
  scale_param {
    filler {
      type: "constant"
      value: 1.0
    }
    bias_term: true
    bias_filler {
      type: "constant"
      value: 0.0
    }
  }
}
