layer {
  name: "rpn_head.cls.head.0"
  type: "Convolution"
  bottom: "cls_feature"
  top: "rpn_head.cls.head.0"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    bias_term: false
    num_output: 256
    pad: 0
    kernel_size: 1
    # group: 2
  }
}
